In [1]:
import pandas as pd
from sqlalchemy import create_engine
import datetime as dt

### Connect to Postgres

In [3]:
DATABASE_URL = 'postgresql://postgres.wjfvdgxkmrtczsjguehg:Cp3656vnmO9XA3vv@aws-0-us-east-1.pooler.supabase.com:6543/postgres'
engine = create_engine(DATABASE_URL)
engine

Engine(postgresql://postgres.wjfvdgxkmrtczsjguehg:***@aws-0-us-east-1.pooler.supabase.com:6543/postgres)

### Read in the two dataset files into DataFrames

In [5]:
mta_df = pd.read_csv('MTA_Monthly_Ridership___Traffic_Data__Beginning_January_2008.csv')
cta_df = pd.read_csv('CTA_-_Ridership_-_Daily_Boarding_Totals_20240819.csv')

In [6]:
cta_df.head()

  service_date day_type     bus  rail_boardings  total_rides
0   01/01/2001        U  297192          126455       423647
1   01/02/2001        W  780827          501952      1282779
2   01/03/2001        W  824923          536432      1361355
3   01/04/2001        W  870021          550011      1420032
4   01/05/2001        W  890426          557917      1448343

In [7]:
cta_df.dtypes

service_date      object
day_type          object
bus                int64
rail_boardings     int64
total_rides        int64
dtype: object

In [8]:
mta_df.head()

        Month Agency  Ridership
0  01/01/2008    MNR    6453734
1  02/01/2008    MNR    6144377
2  03/01/2008    MNR    6602280
3  04/01/2008    B&T   24900328
4  04/01/2008    MNR    6787480

In [9]:
mta_df.dtypes

Month        object
Agency       object
Ridership     int64
dtype: object

### Cleaning MTA Dataframe

In [11]:
mta_df.Agency.unique()

array(['MNR', 'B&T', 'Bus', 'Subway', 'LIRR', 'AAR', 'SIR'], dtype=object)

In [12]:
mta_df.loc[mta_df.Agency == 'Bus', 'transportation_type'] = 'bus'
mta_df.loc[mta_df.Agency != 'Bus', 'transportation_type'] = 'metro'

In [13]:
def standardize_date(date: str):
    date_format = '%m/%d/%Y'
    date = dt.datetime.strptime(date, date_format)
    date = dt.date(year=date.year, month=date.month, day=1)
    return date.strftime(date_format)

mta_df['Month'] = mta_df['Month'].apply(standardize_date)

In [14]:
mta_df = mta_df.rename(columns={'Month': 'month', 'Agency':'agency', 'Ridership':'ridership_count'})
mta_df = mta_df.groupby(['month', 'transportation_type']).agg({'ridership_count': 'sum'}).reset_index()
mta_df['city'] = ['New York'] * len(mta_df)

In [15]:
mta_df.head()

        month transportation_type  ridership_count      city
0  01/01/2008               metro          6453734  New York
1  01/01/2009               metro         28436944  New York
2  01/01/2010               metro         28536008  New York
3  01/01/2011               metro         26584121  New York
4  01/01/2012               metro         28476355  New York

### Cleaning CTA Dataframe

In [17]:
cta_df = cta_df.drop(columns=['day_type', 'total_rides'])
cta_df = cta_df.melt(['service_date'], var_name='transportation_type', value_name='ridership_count')

cta_df = cta_df.rename(columns={'service_date': 'month'})
cta_df['month'] = cta_df['month'].apply(standardize_date)

cta_df = cta_df.groupby(['month', 'transportation_type']).agg({'ridership_count': 'sum'}).reset_index()
cta_df['city'] = ['Chicago'] * len(cta_df)

In [18]:
cta_df.loc[cta_df.transportation_type == 'bus', 'transportation_type'] = 'bus'
cta_df.loc[cta_df.transportation_type != 'bus', 'transportation_type'] = 'metro'

In [19]:
cta_df.head()

        month transportation_type  ridership_count     city
0  01/01/2001                 bus         25022908  Chicago
1  01/01/2001               metro         14712334  Chicago
2  01/01/2002                 bus         24807048  Chicago
3  01/01/2002               metro         14575032  Chicago
4  01/01/2003                 bus         24105413  Chicago

### Combine Dataframes

In [21]:
monthly_totals = pd.concat([mta_df, cta_df], axis='rows')
monthly_totals.head()

        month transportation_type  ridership_count      city
0  01/01/2008               metro          6453734  New York
1  01/01/2009               metro         28436944  New York
2  01/01/2010               metro         28536008  New York
3  01/01/2011               metro         26584121  New York
4  01/01/2012               metro         28476355  New York

In [22]:
monthly_totals.dtypes

month                  object
transportation_type    object
ridership_count         int64
city                   object
dtype: object

### Create Monthly Totals SQL Table

In [24]:
with engine.connect() as conn:
    monthly_totals.to_sql("monthly_totals", conn, index=False)

In [25]:
pd.read_sql('SELECT * FROM monthly_totals', engine).head()

        month transportation_type  ridership_count      city
0  01/01/2008               metro          6453734  New York
1  01/01/2009               metro         28436944  New York
2  01/01/2010               metro         28536008  New York
3  01/01/2011               metro         26584121  New York
4  01/01/2012               metro         28476355  New York

In [59]:
bus_monthly_totals = monthly_totals[monthly_totals['transportation_type'] == 'bus']

In [27]:
with engine.connect() as conn:
    bus_monthly_totals.to_sql("bus_monthly_totals", conn, index=False)

In [28]:
pd.read_sql('SELECT * FROM bus_monthly_totals', engine).head()

        month transportation_type  ridership_count      city
0  01/01/2018                 bus         45398837  New York
1  01/01/2019                 bus         44510954  New York
2  01/01/2020                 bus         45145397  New York
3  01/01/2021                 bus         20769132  New York
4  01/01/2022                 bus         23255396  New York

In [57]:
metro_monthly_totals = monthly_totals[monthly_totals['transportation_type'] == 'metro']

In [30]:
with engine.connect() as conn:
    metro_monthly_totals.to_sql("metro_monthly_totals", conn, index=False)

In [31]:
pd.read_sql('SELECT * FROM metro_monthly_totals', engine).head()

        month transportation_type  ridership_count      city
0  01/01/2008               metro          6453734  New York
1  01/01/2009               metro         28436944  New York
2  01/01/2010               metro         28536008  New York
3  01/01/2011               metro         26584121  New York
4  01/01/2012               metro         28476355  New York